{
    "config": {
        "imgPath": "/images/"
    },
    "meta": {
        "title": "Alex Beuscher : Portfolio and Resume",
        "author": "Alex Beuscher",
        "description": "Alex Beuscher is a web developer living in Alameda, CA. He has most recently worked at Dynamic Signal in San Bruno, CA and is seeking new employment opportunities.",
        "keywords": "front end developer, web development alameda",
        "site_url": "alexbeuscher.com",
        "site_thumb": "al_pic-lg.jpg"
    },
    "header": {
        "name": "Alex Beuscher",
        "site_title": "Portfolio & Resume",
        "nav": [
            {
                "text": "",
                "class": "icon-github",
                "url": "https://github.com/abeuscher/portfolio-site"
            },
            {
                "text": "",
                "class": "icon-linkedin",
                "url": "https://www.linkedin.com/in/alex-beuscher-8314157/"
            },
            {
                "text": "pdf",
                "url": "/images/resume_alexbeuscher_20170129.pdf"
            }
        ],
        "contact": [
            {
                "text": "alexbeuscher@gmail.com",
                "url": "mailto:alexbeuscher@gmail.com"
            },
            {
                "text": "617.359.6971",
                "url": "tel:6173596971"
            }
        ]
    },
    "footer": {
        "legal": "© Alex Beuscher 2020"
    },
    "overview": {
        "title": "overview",
        "intro_header": "Overview",
        "intro": "My name is Al and I build websites. I am currently working as a web developer in the San Francisco Bay Area. I have over twenty years of experience in the field and have spent the past ten here in California primarily focused on front-end development. As a sole/lead tech in most of the roles I have held, I have worked with internal and external stakeholders, agencies, sub-contractors and other third parties as both director and collaborator. I have also worked professionally as a video producer, video editor, copy editor, trainer, tutor, voice-over artist, dj, and master of ceremonies.",
        "skills_header": "Skills",
        "skills": [
            {
                "title": "Javascript",
                "level": 3
            },
            {
                "title": "HTML",
                "level": 3
            },
            {
                "title": "PHP",
                "level": 2
            },
            {
                "title": "jQuery",
                "level": 3
            },
            {
                "title": "SQL",
                "level": 2
            },
            {
                "title": "CSS / SCSS",
                "level": 3
            },
            {
                "title": "Angular",
                "level": 1
            },
            {
                "title": "React",
                "level": 1
            },
            {
                "title": "Gulp",
                "level": 2
            },
            {
                "title": "Expression Engine",
                "level": 3
            },
            {
                "title": "Wordpress",
                "level": 2
            },
            {
                "title": "Vue",
                "level": 1
            },
            {
                "title": "Cockpit CMS",
                "level": 3
            },
            {
                "title": "Final Cut",
                "level": 2
            },
            {
                "title": "Adobe Design",
                "level": 3
            },
            {
                "title": "ZenDesk",
                "level": 1
            },
            {
                "title": "Git",
                "level": 3
            },
            {
                "title": "Jade/Pug",
                "level": 3
            },
            {
                "title": "Marketo",
                "level": 3
            }
        ]
    },
    "portfolio": {
        "title": "portfolio",
        "template": "portfolio.pug",
        "sites_title": "Case Studies",
        "sites": [
            {
                "title": "Dynamic Signal",
                "thumbs": [
                    "thm-dynamicsignal-desktop.jpg",
                    "thm-dynamicsignal-mobile.jpg"
                ],
                "role": "Developer / Designer",
                "tech": "Wordpress, Pug, Gulp",
                "description": "I came into this site after it had been online for several years. I was first brought in to manage an agency who were rebuilding portions of the site. After they were done, I began a ground-up reworking of the site theme using modern practices, version control, and a preprocessor (gulp) to build the theme and allow for some decoupling from the Wordpress core to increase page speed and site flexibility. I was able to reduce page load time from an avergae of 14s per page to a more reasonable 2.5s per page, and also to export the site header and footer via js injection to our third party properties, thus maintaining visual cotinuity between our two third party providers (MArketo and Uberflip) as well as syntactic continuity in the header and footer space.",
                "url": "https://www.dynamicsignal.com",
                "modal_thumb": "thm-ds.jpg"
            },
            {
                "title": "Dynamic Signal Support",
                "thumbs": [
                    "thm-dssupport-desktop.jpg",
                    "thm-dssupport-mobile.jpg"
                ],
                "role": "Developer",
                "tech": "Zendesk, Vue, Theming & Customization",
                "description": "The Dynamic Signal Support site is built on the ZenDesk platform. This site uses a custom Zendesk theme (repo available on request) to serve suppot pages for our site. This was a cross-departmental effort which I ran and coordinated and continue to provide support for.",
                "url": "https://www.xcom.com",
                "modal_thumb": "thm-ds.jpg"
            },
            {
                "title": "XCOM",
                "thumbs": [
                    "thm-xcom-desktop.jpg",
                    "thm-xcom-mobile.jpg"
                ],
                "role": "Developer",
                "tech": "Expression Engine, Telemetry, Localization",
                "description": "This site was built using Expression Engine. News was imported to the site from a central CMS, where localized content was provided by editors in multiple locations. The site also feature a telemtry piece, which is a javascript application which surfaces data from a REST API provided to us by the developer, Firaxis Games. It is written in Vanilla JS, with portions of the API interaction written in PHP to make an oAuth connection and cache data over intervals from the API to limit requests.",
                "url": "https://www.xcom.com",
                "modal_thumb": "thm-xcom-modal.jpg"
            },
            {
                "title": "WWE 2K",
                "thumbs": [
                    "thm-wwe-desktop.jpg",
                    "thm-wwe-mobile.jpg"
                ],
                "role": "Developer",
                "tech": "Expression Engine, Localization, Oauth",
                "description": "In its iteration, WWE 2K has become a sophisticated site. As we grew to understand the brand and audience and streamline our own processes, we were better able to serve the need. This site was constructed using Expression Engine, with a centralized CMS. The challenge of introducing third party developers into a secure, distributed environment was ongoing at 2k. We worked to incorporate a third party promotional web application with the WWE site in its most recent year, where visitors could participate in a small web game which encouraged sign up for My2K, a customer loyalty program. This program performed well with customers, bringing our audience a reason to return.",
                "url": "https://wwe.2k.com/",
                "modal_thumb": "thm-wwe-modal.jpg"
            },
            {
                "title": "WWE 2K Logo Uploader",
                "thumbs": [
                    "thm-uploader-desktop.jpg"
                ],
                "role": "Developer",
                "tech": "PHP, Rest API, Memcache, Oauth",
                "description": "This site was built to interface with the in-game experience of WWE 2K. Players may upload and manage their in game images from the site. This was a front end application built in javascript with a php component, connecting to a REST API endpoint provided through a third party. The interior design of the application was skinned to match the in game experience.",
                "url": "https://wwe.2k.com/wwe2k17logo/",
                "modal_thumb": "thm-wwe-modal.jpg"
            },
            {
                "title": "Borderlands",
                "thumbs": [
                    "thm-borderlands-desktop.jpg",
                    "thm-borderlands-mobile.jpg"
                ],
                "role": "Developer",
                "tech": "Expression Engine, Localization, Social Media API",
                "description": "Borderlands is a large, well known franchise. The challenge here was in creating a visual spectacle with the site to showcase the franchise's unique look and feel. Also, with a large amount of DLC, the relationships between various products and package deals was a taxonomical challenge. With a localized site, content spaces with so much imagery had to be carefully designed to be flexible to fit differently sized strings. Additionally, the site features social media API interaction and a Skill Tree calculator web application.",
                "url": "https://www.borderlandsthegame.com/",
                "modal_thumb": "thm-borderlands-modal.jpg"
            },
            {
                "title": "DJ Michael",
                "thumbs": [
                    "thm-djm-desktop.jpg",
                    "thm-djm-mobile.jpg"
                ],
                "role": "Private Contractor",
                "tech": "Cockpit CMS, Jade/Pug, Templating",
                "description": "This is a site built for Michael O'Neill, who provides DJ services for weddings and events throughout New England. The site is built with Cockpit CMS and custom. Design work was sub contracted, and provided as PSD's. I did the site build using a basic preprocessing script leveraging gulp and browserify, and the templates are done in php. This was a straightforward job with an old friend and client, and I am happy with the result.",
                "url": "http://djmichael.com"
            },
            {
                "title": "MCO Productions",
                "thumbs": [
                    "thm-mco-desktop.jpg"
                ],
                "role": "Private Contractor",
                "tech": "Wordpress, Custom Theme",
                "description": "This site is currently under rebuild. In its current iteration, the site is built in Wordpress with a custom theme and some custom plugin work as well. Future build will utilize Cockpit CMS, and feature more application like behavior and a cleaner more modern design.",
                "url": "http://mcoproductions.com"
            }
        ]
    },
    "resume": {
        "title": "resume",
        "template": "jobs.pug",
        "intro": "",
        "pdf_link": "",
        "jobs_title": "Work History",
        "jobs": [
            {
                "name": "Dynamic Signal",
                "description": "I have been in charge of the public facing web properties at Dynamic Signal for the past several years. This includes a public Wordpress Site, a support site at Zendesk, a Marketo Installation, and a Content Hub at Uberflip among others. My work also involved analytics, strategy, content creation (written and video), and coordination with external consultancies around SEO concerns.",
                "location": "San Bruno, CA",
                "url": "dynamicsignal.com",
                "thumb": "thm-ds.jpg",
                "positions": [
                    {
                        "time_span": "2018 - 2020",
                        "title": "Senior Web Developer",
                        "description": ""
                    },
                    {
                        "time_span": "2017 - 2018",
                        "title": "Web Production Manager",
                        "description": ""
                    }
                ]
            },
            {
                "name": "2K Games",
                "description": "I was the first developer on the marketing department's web team at 2K. Previously sites were built through managed third parties. There was no source control or modular approach to site builds. As a means to help our editors, we planned and built a central CMS as a data source. From here we exported data to our public facing sites, both those built internally and those sourced from third parties. We also added source control and continuous deploy, and adopted a modular approach to code building. In the course of this, we began hosting sites in AWS, migrating older properties from a less sophisticated server environment. After growing our team I was promoted to a senior position. By the end of my time at 2K, most work was being done in house, with a greatly improved content editing workflow.",
                "location": "Novato, CA",
                "url": "2k.com",
                "thumb": "thm-2k.jpg",
                "positions": [
                    {
                        "time_span": "2016 - 2017",
                        "title": "Senior Web Developer",
                        "description": ""
                    },
                    {
                        "time_span": "2013 - 2016",
                        "title": "Web Developer",
                        "description": ""
                    }
                ]
            },
            {
                "name": "Medley Health",
                "description": "Medley was a startup company in the medical industry, who provided membership model practice management services for primary care physicians. I ran their public websites, managed content, and provided other web related support and development. The company is now defunct.",
                "location": "Dublin, CA",
                "url": "",
                "thumb": "thm-medley.jpg",
                "positions": [
                    {
                        "time_span": "2011 - 2012",
                        "title": "Web Content Manager / Developer",
                        "description": ""
                    }
                ]
            },
            {
                "name": "WAAF and Mike FM (Entercom)",
                "description": "WAAF and Mike FM are/were two Boston music radio stations owned by Entercom. WAAF remains a top rated station, while Mike FM has since gone off-air. I managed a team of content producers, and also worked in a variety of roles to support and create video, web, and mobile content for our listeners in conjunction with our station's on-air personalities as well as local and national celebrities. On the development side, I built several novelty apps which we hosted at the station sites, and provided ongoing support and development for online contesting, event specific microsites, and ad placement on the site. I alspo coached staff and online personalities on blog writing and engaging with the audience over social media.",
                "location": "Brighton, MA",
                "url": "waaf.com",
                "thumb": "thm-waaf.jpg",
                "positions": [
                    {
                        "time_span": "2008 - 2011",
                        "title": "Online Content Director",
                        "description": ""
                    }
                ]
            },
            {
                "name": "Boston Interactive",
                "description": "Boston Interactive is a leading design firm. My duties as a developer there ranged from markup and CSS layout to some php programming projects and a good deal of javascript work. Among the clients serviced were FAO Schwartz, New England Coffee, MedAssets, and many others.",
                "location": "Charlestown, MA",
                "url": "bostoninteractive.com",
                "thumb": "thm-bi.jpg",
                "positions": [
                    {
                        "time_span": "2007 - 2008",
                        "title": "Web Developer",
                        "description": ""
                    }
                ]
            },
            {
                "name": "Nurse-Recruiter.com",
                "description": "Nurse-Recruiter is an online job portal for nurses, similar to Monster.com but specialized. My duties included the design and implementation of an intranet, and redevelopment of web software from PERL into PHP. I also rewrote most of the content on the site for SEO value as well as style, and increased total web visitors as well as goal conversions by over 100% in 10 months.",
                "location": "Wellesley, MA",
                "url": "nurse-recruiter.com",
                "thumb": "thm-nr.jpg",
                "positions": [
                    {
                        "time_span": "2006 - 2007",
                        "title": "Lead Web Developer",
                        "description": ""
                    }
                ]
            },
            {
                "name": "MCO Productions",
                "description": "I have run pub trivia on and off for years, and have experience in DJ'ing and MC'ing functions such as weddings, special events, and parties. I have a full PA system and contract independently.",
                "location": "Brighton, MA",
                "url": "mcoproductions.com",
                "thumb": "thm-mco.jpg",
                "positions": [
                    {
                        "time_span": "2001 - 2011",
                        "title": "Trivia DJ",
                        "description": ""
                    }
                ]
            },
            {
                "name": "Freelance Web Design",
                "description": "I work on and off as a freelance developer and designer. Along with my web work, I do consulting in basic IT, application training, and print design.",
                "location": "Allston, MA / Alameda, CA",
                "url": "alexbeuscher.com",
                "thumb": "thm-self.jpg",
                "positions": [
                    {
                        "time_span": "1998 - present",
                        "title": "Self Employed",
                        "description": ""
                    }
                ]
            },
            {
                "name": "SSDS",
                "description": "Solomon Schechter Day School is a private elementary school. Taught video and web design to children ages 9 to 12 at After School Program. For video, students learned to work with a camera, plan movies, and make short films. In web we learned to make a basic site using a text editor and graphics tools.",
                "location": "",
                "url": "ssdsboston.org",
                "thumb": "thm-ssds.jpg",
                "positions": [
                    {
                        "time_span": "2001 - 2003",
                        "title": "Afterschool Instructor",
                        "description": ""
                    }
                ]
            },
            {
                "name": "AMICAS, Inc.",
                "description": "AMICAS provides software for the management and viewing of medical images (x-rays) inside of a web browser on standard PC's. My responsibilities included redesign and implementation of public website as well as the design of an Intranet Site.",
                "location": "Brighton, MA / Chicago, IL",
                "url": "",
                "thumb": "thm-amicas.jpg",
                "positions": [
                    {
                        "time_span": "1997 - 2000",
                        "title": "Webmaster",
                        "description": ""
                    }
                ]
            }
        ]
    },
    "education": [
        {},
        {}
    ],
    "skills": [
        {
            "title": "Languages",
            "items": [
                "PHP",
                "SQL",
                "HTML",
                "CSS",
                "Javascript",
                "jQuery",
                "ASP",
                "Angular"
            ]
        },
        {
            "title": "Tools",
            "items": [
                "Expression Engine",
                "Wordpress",
                "Drupal",
                "Git",
                "Cockpit CMS",
                "vBulletin",
                "Adobe Design Suite",
                "Maya",
                "ZenDesk",
                "Jade/Pug",
                "More"
            ]
        },
        {
            "title": "Other",
            "items": [
                "Video Production",
                "Audio Editing / Voice Over",
                "DJ",
                "Teacher (uncertified)",
                "Drums (intermediate)",
                "Writing (technical, journalistic, copy editing)"
            ]
        }
    ]
}